{
    "class_name": "Sequential",
    "config": {
        "name": "sequential_67",
        "layers": [
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_179",
                    "trainable": true,
                    "batch_input_shape": [
                        null,
                        784
                    ],
                    "dtype": "float32",
                    "units": 800,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "activation_179",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                }
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_80",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.2942882218369514,
                    "noise_shape": null,
                    "seed": null
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_180",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 900,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "activation_180",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "sigmoid"
                }
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_81",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.43161372685859367,
                    "noise_shape": null,
                    "seed": null
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_181",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 10,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "activation_181",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "sigmoid"
                }
            }
        ]
    },
    "keras_version": "2.3.1",
    "backend": "tensorflow"
}